; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v3 ?v9)
             (pred_11 ?v8 ?v6)
             (pred_3 ?v3 ?v6)
             (pred_2 ?v10 ?v3 )
	     (pred_4 ?v3)
             (pred_12 ?v2)
             (pred_6 ?v8)
             (pred_8 ?v6)
             (pred_9 ?v3)
             (pred_10 ?v8)
             (pred_5 ?v3)
             (pred_1 ))



(:action op_2
:parameters (?v13 ?v5 ?v12 ?v1)
:precondition (and (pred_12 ?v13) (pred_12 ?v5) (pred_6 ?v12) (pred_8 ?v1)
          (pred_7 ?v13 ?v5) (pred_11 ?v12 ?v1)
                   (pred_3 ?v5 ?v1) (pred_4 ?v13) 
                   (pred_9 ?v5) (pred_10 ?v12))
:effect (and  (pred_5 ?v5) (not (pred_9 ?v5))))


(:action op_4
:parameters (?v13 ?v7)
:precondition (and (pred_12 ?v13) (pred_12 ?v7)
               (pred_4 ?v13) (pred_7 ?v13 ?v7) (pred_5 ?v7))
:effect (and (pred_4 ?v7) (not (pred_4 ?v13))))

(:action op_5
:parameters (?v13 ?v12)
:precondition (and (pred_12 ?v13) (pred_6 ?v12) 
                  (pred_4 ?v13) (pred_2 ?v12 ?v13) (pred_1 ))
:effect (and (pred_10 ?v12)
   (not (pred_2 ?v12 ?v13)) (not (pred_1 ))))


(:action op_1
:parameters (?v13 ?v4 ?v11)
:precondition (and (pred_12 ?v13) (pred_6 ?v4) (pred_6 ?v11)
                  (pred_4 ?v13) (pred_10 ?v11) (pred_2 ?v4 ?v13))
:effect (and (pred_10 ?v4) (pred_2 ?v11 ?v13)
        (not (pred_10 ?v11)) (not (pred_2 ?v4 ?v13))))

(:action op_3
:parameters (?v13 ?v12)
:precondition (and (pred_12 ?v13) (pred_6 ?v12) 
                  (pred_4 ?v13) (pred_10 ?v12))
:effect (and (pred_1 ) (pred_2 ?v12 ?v13) (not (pred_10 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_18 obj_13 obj_12 obj_01 obj_04 obj_08 obj_16 obj_05 obj_11 obj_14 obj_15 obj_02 obj_17 obj_07 obj_21
    obj_09 obj_03
    obj_06 obj_10 obj_20
    )

    (:init
       (pred_1)

       (pred_12 obj_19)
       (pred_12 obj_18)
       (pred_12 obj_13)
       (pred_12 obj_12)
       (pred_12 obj_01)
       (pred_12 obj_04)
       (pred_12 obj_08)
       (pred_12 obj_16)
       (pred_12 obj_05)
       (pred_12 obj_11)
       (pred_12 obj_14)
       (pred_12 obj_15)
       (pred_12 obj_02)
       (pred_12 obj_17)
       (pred_12 obj_07)
       (pred_12 obj_21)
       (pred_8 obj_09)
       (pred_8 obj_03)
       (pred_6 obj_06)
       (pred_6 obj_10)
       (pred_6 obj_20)

       (pred_7 obj_19 obj_01)
       (pred_7 obj_19 obj_18)
       (pred_7 obj_18 obj_04)
       (pred_7 obj_18 obj_13)
       (pred_7 obj_18 obj_19)
       (pred_7 obj_13 obj_08)
       (pred_7 obj_13 obj_12)
       (pred_7 obj_13 obj_18)
       (pred_7 obj_12 obj_16)
       (pred_7 obj_12 obj_13)
       (pred_7 obj_01 obj_05)
       (pred_7 obj_01 obj_04)
       (pred_7 obj_01 obj_19)
       (pred_7 obj_04 obj_11)
       (pred_7 obj_04 obj_08)
       (pred_7 obj_04 obj_18)
       (pred_7 obj_04 obj_01)
       (pred_7 obj_08 obj_14)
       (pred_7 obj_08 obj_16)
       (pred_7 obj_08 obj_13)
       (pred_7 obj_08 obj_04)
       (pred_7 obj_16 obj_15)
       (pred_7 obj_16 obj_12)
       (pred_7 obj_16 obj_08)
       (pred_7 obj_05 obj_02)
       (pred_7 obj_05 obj_11)
       (pred_7 obj_05 obj_01)
       (pred_7 obj_11 obj_17)
       (pred_7 obj_11 obj_14)
       (pred_7 obj_11 obj_04)
       (pred_7 obj_11 obj_05)
       (pred_7 obj_14 obj_07)
       (pred_7 obj_14 obj_15)
       (pred_7 obj_14 obj_08)
       (pred_7 obj_14 obj_11)
       (pred_7 obj_15 obj_21)
       (pred_7 obj_15 obj_16)
       (pred_7 obj_15 obj_14)
       (pred_7 obj_02 obj_17)
       (pred_7 obj_02 obj_05)
       (pred_7 obj_17 obj_07)
       (pred_7 obj_17 obj_11)
       (pred_7 obj_17 obj_02)
       (pred_7 obj_07 obj_21)
       (pred_7 obj_07 obj_14)
       (pred_7 obj_07 obj_17)
       (pred_7 obj_21 obj_15)
       (pred_7 obj_21 obj_07)
       (pred_9 obj_21)
       (pred_9 obj_19)
       (pred_9 obj_04)
       (pred_3  obj_21 obj_09)
       (pred_3  obj_19 obj_03)
       (pred_3  obj_04 obj_03)
       (pred_5 obj_18)
       (pred_5 obj_13)
       (pred_5 obj_12)
       (pred_5 obj_01)
       (pred_5 obj_08)
       (pred_5 obj_16)
       (pred_5 obj_05)
       (pred_5 obj_11)
       (pred_5 obj_14)
       (pred_5 obj_15)
       (pred_5 obj_02)
       (pred_5 obj_17)
       (pred_5 obj_07)

       (pred_11  obj_06 obj_09)
       (pred_11  obj_10 obj_03)
       (pred_11  obj_20 obj_09)
       (pred_2 obj_06 obj_02)
       (pred_2 obj_10 obj_15)
       (pred_2 obj_20 obj_01)
       (pred_4 obj_12)
    )

    (:goal (and
       (pred_2 obj_06 obj_13)
       (pred_2 obj_10 obj_19)
       (pred_2 obj_20 obj_08)
    ))
(:constraints
  (always (not (pred_4 obj_11)))
)
)

; plan
1. (op_4 obj_12 obj_13)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_13)
   goals met: 0 of 3
2. (op_4 obj_13 obj_08)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_08)
   goals met: 0 of 3
3. (op_4 obj_08 obj_14)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_14)
   goals met: 0 of 3
4. (op_4 obj_14 obj_07)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_07)
   goals met: 0 of 3
5. (op_4 obj_07 obj_17)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_17)
   goals met: 0 of 3
6. (op_4 obj_17 obj_02)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_02)
   goals met: 0 of 3
7. (op_5 obj_02 obj_06)
   deleted: (pred_2 obj_06 obj_02) (pred_1)
   added: (pred_10 obj_06)
   goals met: 0 of 3
8. (op_4 obj_02 obj_17)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_17)
   goals met: 0 of 3
9. (op_4 obj_17 obj_07)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_07)
   goals met: 0 of 3
10. (op_4 obj_07 obj_14)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_14)
   goals met: 0 of 3
11. (op_4 obj_14 obj_08)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_08)
   goals met: 0 of 3
12. (op_4 obj_08 obj_13)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_13)
   goals met: 0 of 3
13. (op_3 obj_13 obj_06)
   deleted: (pred_10 obj_06)
   added: (pred_1) (pred_2 obj_06 obj_13)
   goals met: 1 of 3
14. (op_4 obj_13 obj_08)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_08)
   goals met: 1 of 3
15. (op_4 obj_08 obj_14)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_14)
   goals met: 1 of 3
16. (op_4 obj_14 obj_07)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_07)
   goals met: 1 of 3
17. (op_4 obj_07 obj_17)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_17)
   goals met: 1 of 3
18. (op_4 obj_17 obj_02)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_02)
   goals met: 1 of 3
19. (op_4 obj_02 obj_05)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_05)
   goals met: 1 of 3
20. (op_4 obj_05 obj_01)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_01)
   goals met: 1 of 3
21. (op_5 obj_01 obj_20)
   deleted: (pred_2 obj_20 obj_01) (pred_1)
   added: (pred_10 obj_20)
   goals met: 1 of 3
22. (op_4 obj_01 obj_05)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_05)
   goals met: 1 of 3
23. (op_4 obj_05 obj_02)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_02)
   goals met: 1 of 3
24. (op_4 obj_02 obj_17)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_17)
   goals met: 1 of 3
25. (op_4 obj_17 obj_07)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_07)
   goals met: 1 of 3
26. (op_4 obj_07 obj_14)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_14)
   goals met: 1 of 3
27. (op_4 obj_14 obj_08)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_08)
   goals met: 1 of 3
28. (op_3 obj_08 obj_20)
   deleted: (pred_10 obj_20)
   added: (pred_1) (pred_2 obj_20 obj_08)
   goals met: 2 of 3
29. (op_4 obj_08 obj_16)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_16)
   goals met: 2 of 3
30. (op_4 obj_16 obj_15)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_15)
   goals met: 2 of 3
31. (op_5 obj_15 obj_10)
   deleted: (pred_2 obj_10 obj_15) (pred_1)
   added: (pred_10 obj_10)
   goals met: 2 of 3
32. (op_4 obj_15 obj_16)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_16)
   goals met: 2 of 3
33. (op_4 obj_16 obj_12)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_12)
   goals met: 2 of 3
34. (op_4 obj_12 obj_13)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_13)
   goals met: 2 of 3
35. (op_4 obj_13 obj_18)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_18)
   goals met: 2 of 3
36. (op_2 obj_18 obj_19 obj_10 obj_03)
   deleted: (pred_9 obj_19)
   added: (pred_5 obj_19)
   goals met: 2 of 3
37. (op_4 obj_18 obj_19)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_19)
   goals met: 2 of 3
38. (op_3 obj_19 obj_10)
   deleted: (pred_10 obj_10)
   added: (pred_1) (pred_2 obj_10 obj_19)
   goals met: 3 of 3
